//Нехай шість населених пунктів позначені номерами від 1 до 6
//(величина k), а п’ять кандидатів - номерами від 1 до 5. Кількість голосів,
//набраних кандидатами у кожному пункті визначається формулою
//a = random(10i + 50), де і - номер варіанта.Вивести на екран таблицю
//результатів голосування, де у рядках є дані з населених пунктів, а у стовпцях
//- дані щодо конкретних кандидатів.Визначити і вивести значення величин з
//додаткового завдання.Створити одновимірний масив з шуканими даними.
//18. Які номери населених пунктів, де кількість учасників виборів не
//перевищила 450 ?
#include<iostream>
#include<windows.h>
#include<time.h>

int main()
{
    srand(time(NULL));
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    const int TOWNS = 6, СANDIDATE = 5;
    int votes[СANDIDATE][TOWNS];

    for (int i = 0; i < СANDIDATE; i++)
        for (int j = 0; j < TOWNS; j++)
            votes[i][j] = rand() % 10 * 18 + 50;
    printf("+-------------------------------------------------------------------------------------------------------+\n");
    printf("|РЕЗУЛЬТАТИ ГОЛОСУВАННЯ                      |\n");
    printf("+-------------------------------------------------------------------------------------------------------+\n");
    printf("№ населеного пункту  ||1-ий кандидат| |2-ий кандидат| |3-ій кандидат| |4-ий кандидат| |5-ий кандидат||\n");
    printf("+-------------------------------------------------------------------------------------------------------+\n");
    printf("||Населений пункт 1  %13d| |%13d| |%13d| |%13d| |%13d||\n", votes[0][0], votes[1][0], votes[2][0], votes[3][0], votes[4][0]);
    printf("+-------------------------------------------------------------------------------------------------------+\n");
    printf("Населений пункт 2  %13d| |%13d| |%13d| |%13d| |%13d||\n", votes[0][1], votes[1][1], votes[2][1], votes[3][1], votes[4][1]);
    printf("+-------------------------------------------------------------------------------------------------------+\n");
    printf("Населений пункт 3  %13d| |%13d| |%13d| |%13d| |%13d||\n", votes[0][2], votes[1][2], votes[2][2], votes[3][2], votes[4][2]);
    printf("+-------------------------------------------------------------------------------------------------------+\n");
    printf("Населений пункт 4  %13d| |%13d| |%13d| |%13d| |%13d||\n", votes[0][3], votes[1][3], votes[2][3], votes[3][3], votes[4][3]);
    printf("+-------------------------------------------------------------------------------------------------------+\n");
    printf("Населений пункт 5  %13d| |%13d| |%13d| |%13d| |%13d||\n", votes[0][4], votes[1][4], votes[2][4], votes[3][4], votes[4][4]);
    printf("+-------------------------------------------------------------------------------------------------------+\n");
    printf("Населений пункт 6  %13d| |%13d| |%13d| |%13d| |%13d||\n", votes[0][5], votes[1][5], votes[2][5], votes[3][5], votes[4][5]);
    printf("+-------------------------------------------------------------------------------------------------------+\n");

    int s1 = votes[0][0] + votes[1][0] + votes[2][0] + votes[3][0] + votes[4][0];
    int s2 = votes[0][1] + votes[1][1] + votes[2][1] + votes[3][1] + votes[4][1];
    int s3 = votes[0][2] + votes[1][2] + votes[2][2] + votes[3][2] + votes[4][2];
    int s4 = votes[0][3] + votes[1][3] + votes[2][3] + votes[3][3] + votes[4][3];
    int s5 = votes[0][4] + votes[1][4] + votes[2][4] + votes[3][4] + votes[4][4];
    int s6 = votes[0][5] + votes[1][5] + votes[2][5] + votes[3][5] + votes[4][5];

    std::cout << "Загальна кількість виборців у першому нп " << s1 << std::endl;
    std::cout << "Загальна кількість виборців у другому нп " << s2 << std::endl;
    std::cout << "Загальна кількість виборців у третьому нп " << s3 << std::endl;
    std::cout << "Загальна кількість виборців у четвертому нп " << s4 << std::endl;
    std::cout << "Загальна кількість виборців у п'ятому нп " << s5 << std::endl;
    std::cout << "Загальна кількість виборців у шостому нп " << s6 << std::endl;
    int town_arr[TOWNS];
    town_arr[0] = s1;
    town_arr[1] = s2;
    town_arr[2] = s3;
    town_arr[3] = s4;
    town_arr[4] = s5;
    town_arr[5] = s6;

        std::cout << "Населені пункти з кількістю учасників виборів не більше 450:" << std::endl;
    int total_votes = 0;
    for (int i = 0; i < TOWNS; ++i) {
        total_votes = town_arr[i];
        if (total_votes < 450) {
            std::cout << "Населений пункт " << i + 1 << std::endl;
        }
    }
    return 0;
}